//
//  MarketDataModel.swift
//  CryptoCoins
//
//  Created by Александр Прайд on 28.07.2023.
//

import Foundation

// JSON Data:
/*
 URL: https://api.coingecko.com/api/v3/global
 
 JSON Response
 
 {
   "data": {
     "active_cryptocurrencies": 10058,
     "upcoming_icos": 0,
     "ongoing_icos": 49,
     "ended_icos": 3376,
     "markets": 784,
     "total_market_cap": {
       "btc": 41963976.111804456,
       "eth": 657165946.9860965,
       "ltc": 13427731585.483822,
       "bch": 5042563136.724869,
       "bnb": 5076993713.150496,
       "eos": 1650265928883.6736,
       "xrp": 1727338762557.959,
       "xlm": 7735457500360.343,
       "link": 155463185082.78207,
       "dot": 235950060790.43173,
       "yfi": 175228435.15686333,
       "usd": 1224086979120.7043,
       "aed": 4496114317354.593,
       "ars": 334192619338959.25,
       "aud": 1843389304467.2385,
       "bdt": 132875706539224.2,
       "bhd": 461346141560.8001,
       "bmd": 1224086979120.7043,
       "brl": 5805966950667.397,
       "cad": 1620534477222.4817,
       "chf": 1066360923687.0433,
       "clp": 1016322696154545,
       "cny": 8769848753212.372,
       "czk": 26893509193896.414,
       "dkk": 8323135347399.9795,
       "eur": 1116614590527.8623,
       "gbp": 956152700695.8667,
       "hkd": 9547186827998.3,
       "huf": 428149175658444.5,
       "idr": 18506542606883212,
       "ils": 4545593137137.646,
       "inr": 100681769748428.38,
       "jpy": 171029908757930.16,
       "krw": 1568116758028059,
       "kwd": 376026055029.1097,
       "lkr": 404681014369178,
       "mmk": 2571297780007548,
       "mxn": 20521936941395.582,
       "myr": 5577552320363.486,
       "ngn": 961625990183698,
       "nok": 12498057810042.176,
       "nzd": 1997122388175.0085,
       "php": 67241539816623.73,
       "pkr": 351135647888281.3,
       "pln": 4941800714191.522,
       "rub": 111235848906494.02,
       "sar": 4591919932949.469,
       "sek": 12923066929627.793,
       "sgd": 1632077617435.5903,
       "thb": 42270171562996.3,
       "try": 32996611017875.582,
       "twd": 38449794877073.414,
       "uah": 45220322781896.31,
       "vef": 122567829219.3561,
       "vnd": 29003367698909450,
       "zar": 21869142588876.242,
       "xdr": 909764700535.108,
       "xag": 50689931440.17997,
       "xau": 627785248.1118449,
       "bits": 41963976111804.45,
       "sats": 4196397611180445.5
     },
     "total_volume": {
       "btc": 1086030.3689772724,
       "eth": 17007496.47705201,
       "ltc": 347510546.8904458,
       "bch": 130501854.48056239,
       "bnb": 131392919.98684327,
       "eos": 42708987129.36787,
       "xrp": 44703636963.55892,
       "xlm": 200194131770.11053,
       "link": 4023397111.0840898,
       "dot": 6106402570.092963,
       "yfi": 4534923.039268103,
       "usd": 31679448821.837803,
       "aed": 116359724303.31839,
       "ars": 8648926229563.723,
       "aud": 47707032364.2701,
       "bdt": 3438831730730.9663,
       "bhd": 11939667466.462393,
       "bmd": 31679448821.837803,
       "brl": 150258793706.8585,
       "cad": 41939535270.66396,
       "chf": 27597488482.246357,
       "clp": 26302495973307.215,
       "cny": 226964243139.17468,
       "czk": 696005727272.4694,
       "dkk": 215403271803.92853,
       "eur": 28898056574.178024,
       "gbp": 24745292666.469772,
       "hkd": 247081801921.75076,
       "huf": 11080527878931.28,
       "idr": 478950498930277.5,
       "ils": 117640239304.1463,
       "inr": 2605650600358.915,
       "jpy": 4426264909208.03,
       "krw": 40582961366275.234,
       "kwd": 9731578204.131523,
       "lkr": 10473170373143.578,
       "mmk": 66545349976655.51,
       "mxn": 531109032404.6464,
       "myr": 144347408556.70386,
       "ngn": 24886941746293.668,
       "nok": 323450530492.539,
       "nzd": 51685654341.80473,
       "php": 1740215324283.9521,
       "pkr": 9087412885308.354,
       "pln": 127894116581.00357,
       "rub": 2878790839780.248,
       "sar": 118839179724.25812,
       "sek": 334449793520.7255,
       "sgd": 42238272473.0539,
       "thb": 1093954726715.7065,
       "try": 853954390386.341,
       "twd": 995083135263.2971,
       "uah": 1170304827770.584,
       "vef": 3172063210.530618,
       "vnd": 750608999483478.5,
       "zar": 565974800188.9845,
       "xdr": 23544768273.9174,
       "xag": 1311858647.4918308,
       "xau": 16247122.122767745,
       "bits": 1086030368977.2725,
       "sats": 108603036897727.23
     },
     "market_cap_percentage": {
       "btc": 46.328367640697344,
       "eth": 18.372070906724307,
       "usdt": 6.848579618235612,
       "xrp": 3.0484438896486354,
       "bnb": 3.0295615018466,
       "usdc": 2.1724782696407168,
       "steth": 1.19826032543682,
       "ada": 0.8845428160505603,
       "doge": 0.8761362373063609,
       "sol": 0.8153125187755181
     },
     "market_cap_change_percentage_24h_usd": -0.6950008809829357,
     "updated_at": 1690533616
   }
 }
 
 
 */

struct GlobalData: Codable {
    let data: MarketDataModel?
}

struct MarketDataModel: Codable {
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double

    enum CodingKeys: String, CodingKey {
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd" 
    }
    
    var marketCup: String {
        if let item = totalMarketCap.first(where: { $0.key == "usd"}) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var volume: String {
        if let item = totalVolume.first(where: { $0.key == "usd" }) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var btcDominance: String {
        if let item = marketCapPercentage.first(where: { $0.key == "btc" }) {
            return item.value.asPercentString()
        }
        return ""
    }
}
